
## Plan Result (ithc)




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.postgresql_v15.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.postgresql_v15.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.postgresql_v15.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.postgresql_v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;log_lock_waits&#34;]
  * module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;pg_qs.query_capture_mode&#34;]
  * module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;pgms_wait_sampling.query_capture_mode&#34;]
  * module.postgresql_v15.terraform_data.trigger_password_reset


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql_v15.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "action_group-ccd-data-store-api-postgres-db-v15-ithc"
      + resource_group_name = "ccd-data-store-api-postgres-db-v15-data-ithc"
      + short_name          = "action_group"
      + tags                = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-data-store-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "ithc"
          + "managedBy"           = "CCD"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.postgresql_v15.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 5%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_ccd-data-store-api-postgres-db-v15-ithc"
      + resource_group_name      = "ccd-data-store-api-postgres-db-v15-data-ithc"
      + scopes                   = [
          + "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccd-data-store-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-data-store-api-postgres-db-v15-ithc",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-data-store-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "ithc"
          + "managedBy"           = "CCD"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 5
        }
    }

  # module.postgresql_v15.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 5%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_ccd-data-store-api-postgres-db-v15-ithc"
      + resource_group_name      = "ccd-data-store-api-postgres-db-v15-data-ithc"
      + scopes                   = [
          + "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccd-data-store-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-data-store-api-postgres-db-v15-ithc",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-data-store-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "ithc"
          + "managedBy"           = "CCD"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 5
        }
    }

  # module.postgresql_v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 0.5%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_ccd-data-store-api-postgres-db-v15-ithc"
      + resource_group_name      = "ccd-data-store-api-postgres-db-v15-data-ithc"
      + scopes                   = [
          + "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccd-data-store-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-data-store-api-postgres-db-v15-ithc",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-data-store-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "ithc"
          + "managedBy"           = "CCD"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 0.5
        }
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["log_lock_waits"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "log_lock_waits"
      + server_id = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccd-data-store-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-data-store-api-postgres-db-v15-ithc"
      + value     = "on"
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["pg_qs.query_capture_mode"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "pg_qs.query_capture_mode"
      + server_id = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccd-data-store-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-data-store-api-postgres-db-v15-ithc"
      + value     = "ALL"
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["pgms_wait_sampling.query_capture_mode"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "pgms_wait_sampling.query_capture_mode"
      + server_id = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccd-data-store-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-data-store-api-postgres-db-v15-ithc"
      + value     = "ALL"
    }

  # module.postgresql_v15.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2557,"Program":"tfcmt","SHA1":"","Target":"ithc","Vars":{}} -->